# IFCCategory Template Set Active Template Method

Source: https://www.revitapidocs.com/2026/a3e652e9-816e-7486-70ec-a452a2fce0d3.htm

---

| IFCCategory Template Set Active Template Method |
| --- |

Sets the mapping template element to be the active mapping template for its document.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetActiveTemplate()
```

```
Public Sub SetActiveTemplate
```

```
public:
void SetActiveTemplate()
```

```
member SetActiveTemplate : unit -> unit
```
Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Invalid use of in\-session template. |

See Also

#### Reference

IFCCategoryTemplate Class SetActiveTemplate Overload Autodesk.Revit.DB Namespace